nc: 22

head:
  dropout: 0.2

backbone:
  - [-1, 1, ConvBnRelu,     [32, 3, 2, 1, 1]]

  # Stage 1: 112x112 -> 56x56
  - [-1, 1, GLKA_Shuffle, [64, 3, 2, "eca"]]
  - [-1, 1, GLKA_Shuffle, [64, 3, 1]]

  # Stage 2: 56x56 -> 28x28
  - [-1, 1, GLKA_Shuffle, [128, 3, 2, "eca"]]
  - [-1, 1, GLKA_Shuffle, [128, 3, 1]]

  # Stage 3: 28x28 -> 14x14
  - [-1, 1, GLKA_Shuffle, [256, 3, 2, "eca"]]
  - [-1, 1, GLKA_Shuffle, [256, 3, 1]]

  # Stage 4: 14x14 -> 7x7
  - [-1, 1, GLKA_Shuffle, [512, 3, 2, "eca"]]
  - [-1, 1, GLKA_Shuffle, [512, 3, 1]]