nc: 22

head:
  dropout: 0.2
  mid_features: 0
  use_bn: true

backbone:
  # Stage 0: Stem (224 -> 112)
  - [-1, 1, ConvBnRelu,       [32,  3, 2, 1, 1, false]]


  - [-1, 1, ShuffleGLKABlock, [64,  2, 0.25, true, 3, 8]]
  - [-1, 1, ShuffleGLKABlock, [64,  1, 0.25, true, 3, 8]]

  - [-1, 1, EfficientBlock,   [64,  1, 2, true, "shuffle", 5, 16, true]]
  - [-1, 1, ShuffleGLKABlock, [128, 2, 0.75, true, 3, 8]]


  - [-1, 1, EfficientBlock,   [128, 1, 2, true, "shuffle", 5, 16, true]]
  - [-1, 1, ShuffleGLKABlock, [256, 2, 0.75, true, 5, 8]]

  - [-1, 1, ShuffleGLKABlock, [512, 2, 0.75, true, 7, 8]]