nc: 22

head:
  dropout: 0.3
  mid_features: 0
  use_bn: false
# ------------------------------------------------------------------------------
# BACKBONE ARCHITECTURE
# Arguments: [out_channels, stride, expansion_ratio, use_glka, glka_variant, glka_K, se_reduction, no_residual]
# ----
backbone:
  - [-1, 1, ConvBnRelu,     [32, 3, 2, 1, 1]] #112

  - [-1, 1, EfficientBlock, [32,  1, 2, true, "shuffle", 3, 8, true]] #112
  - [-1, 1, EfficientBlock, [64,  2, 2, true, "shuffle",3, 8, false]] #56

  - [-1, 1, EfficientBlock, [64,  1, 2, true, "shuffle",3, 8, true]]
  - [-1, 1, EfficientBlock, [128, 2, 2, true, "shuffle", 3, 8, false]] #28

  - [-1, 1, EfficientBlock, [128, 1, 2, true, "shuffle", 3, 8, true]] #
  - [-1, 1, EfficientBlock, [256, 2, 2, true, "shuffle", 3, 8, false]]