nc: 22

head:
  dropout: 0.2        
  mid_features: 0     
  use_bn: true         

# ------------------------------------------------------------------------------
# BACKBONE ARCHITECTURE
# Format: [from_layer, repeats, block_name, [arguments_list]]
# ------------------------------------------------------------------------------
backbone:
  # Stage 0: Stem convolution (Input: 224x224 -> Output: 112x112)
  - [-1, 1, ConvBnRelu,       [32,  3, 2, 1, 1, false]]

  # Stage 1: Shallow features (Output: 56x56)
  - [-1, 1, ShuffleGLKABlock, [64,  2, 1, true, 3, 16]]
  - [-1, 1, ShuffleGLKABlock, [64,  1, 0.75, true,  3, 16]]

  # Stage 2: Mid-level features (Output: 28x28)
  - [-1, 1, ShuffleGLKABlock, [128, 2, 1,  true,  3, 16]]
  - [-1, 1, ShuffleGLKABlock, [128, 1, 0.75,  true,  7, 4]]

  # Stage 3: Deep features with Large Kernel & SE Attention (Output: 14x14)
  - [-1, 1, ShuffleGLKABlock, [256, 2, 1, true,  3, 16]]
  - [-1, 1, ShuffleGLKABlock, [256, 1, 0.75, true,  7, 4]]

  # Stage 4: High-level context extraction (Output: 7x7)
  - [-1, 1, ShuffleGLKABlock, [512, 2, 1, true,  3, 16]]