#ShuffleGLKABlock(out_channels, stride, split_ratio, use_glka, glka_K, se_reduction)
nc: 22
head:
  dropout:      0.2
  mid_features: 0   # 0 để tắt bottleneck
  use_bn:       true

backbone:
  - [-1, 1, ConvBnRelu,       [32,  3, 2, 1, 1, false]] #224
  - [-1, 1, ShuffleGLKABlock, [64,  2, 0.5, false, 3, 0]] #112
  - [-1, 1, ShuffleGLKABlock, [64,  1, 0.5, true,  3, 0]] #112
  - [-1, 1, ShuffleGLKABlock, [128, 2, 0.5, true,  5, 0]]  #56
  - [-1, 1, ShuffleGLKABlock, [128, 1, 0.5, true,  7, 0]] #56
  - [-1, 1, ShuffleGLKABlock, [256, 2, 0.5, true,  13, 16]] #28
  - [-1, 1, ShuffleGLKABlock, [256, 1, 0.5, true,  13, 8]]   #28
  - [-1, 1, ShuffleGLKABlock, [512, 2, 0.5, true,  13, 4]]   #14