nc: 22

head:
  dropout: 0.2

backbone:
  - [-1, 1, ConvBnRelu,     [32, 3, 2, 1, 1]]           # stem: 224 -> 112, in=3

  # Stage 1: 112x112 -> 56x56
  - [-1, 1, Dual_Attention_Block, [64,  2, 3]]           # 112 -> 56, 32 -> 64
  - [-1, 1, Dual_Attention_Block, [64,  1, 3]]           # 56,  64

  # Stage 2: 56x56 -> 28x28
  - [-1, 1, Dual_Attention_Block, [128, 2, 3]]           # 56 -> 28, 64 -> 128
  - [-1, 1, Dual_Attention_Block, [128, 1, 3]]           # 28, 128

  # Stage 3: 28x28 -> 14x14
  - [-1, 1, Dual_Attention_Block, [256, 2, 3]]           # 28 -> 14, 128 -> 256
  - [-1, 1, Dual_Attention_Block, [256, 1, 3]]           # 14, 256

  # Stage 4: 14x14 -> 7x7
  - [-1, 1, Dual_Attention_Block, [512, 2, 3]]          # 14 -> 7, 256 -> 512
  - [-1, 1, Dual_Attention_Block, [512, 1, 3]]          # 7,  512